import React from "react";
import "./CourseContent.css";
import Image from "next/image";

function CourseContent() {
  const CourseData = [
    // {
    //   header: "โครงการ National Project 2025  🏆",
    //   content:
    //     "เปิดโอกาสให้น้องๆ ทั่วประเทศ สามารถสมัครเข้าร่วมฝึกฝนทักษะ พัฒนาผลงานร่วมกับทีมงาน Hamster Hub เข้าแข่งในรายการ National Software Contest 2025 ได้ทั้งทักษะสำคัญ รางวัลและโควต้าเข้าศึกษาต่อในมหาวิทยาลัยชั้นนำ",
    //   video: null,
    // },
    {
      header: "สอนอะไรบ้าง?",
      content:
        "เราสอนเฉพาะที่น้องจะได้ใช้งานจริง โดยเฉพาะเรื่องยากในวิศวะฯ ไว้ก่อน เช่นการเขียนโปรแกรม การแก้ bug Lorem ipsum dolor, sit amet consectetur adipisicing elit. Magni neque",
      video: null,
    },
    {
      header: "ทำไมต้องฝึกสร้างผลงาน ?",
      content:
        "เปิดโอกาสให้น้องๆ ทั่วประเทศ สามารถสมัครเข้าร่วมฝึกฝนทักษะ พัฒนาผลงานร่วมกับทีมงาน Hamster Hub Lorem ipsum dolor, sit amet consectetur adipisicing elit.",
      video: null,
    },
    // {
    //   header: "สอนอะไรบ้าง?",
    //   content:
    //     "เราสอนเฉพาะที่น้องจะได้ใช้งานจริง🦾 โดยเฉพาะเรื่องยากในวิศวะฯ ไว้ก่อน เช่นการเขียนโปรแกรม การแก้ bug และการออกแบบซอฟต์แวร์ที่ดี ตามหลักของ ⚙ Software Engineering ⚙ และออกแบบเชิงวัตถุ (Object Oriented Design) ยังมีเทคนิคอีกหลายอย่างที่น้องควรได้ฝึกเพื่อความได้เปรียบ",
    //     video: null,
    // },
    // {
    //   header: "สอนอย่างไรล่ะ ถ้าน้องไม่มีพื้นฐานเรียนได้ไหม?",
    //   content:
    //     "เริ่มที่ตัวน้องก่อนเลย เพราะเป็นการสอนสด เราจะเห็นจุดเด่นได้ชัด ได้ฝึกฝนจุดเด่นของน้องจนมั่นใจ แล้วค่อยๆ ปรับจุดอ่อน ฝึกให้น้องได้เห็นตัวเอง แก้ปัญหาด้วยตัวเอง โดยการ inspire ให้เห็นความสนุก🤣 ของการสร้างคุณค่าให้ตนเอง☝ สร้างประโยชน์ให้คนอื่น",

    // },

    // {
    //   header: "คุ้มไหม 🙋‍♂️?",
    //   content:
    //     "โครงการนี้มีระยะเวลา 9 เดือน สัปดาห์ละ 2 วัน วันละ 2 ชม. รวม 150 ชั่วโมง สอนสดด้วยทีมงานมืออาชีพ ที่สร้างผลงานระดับเข้ารอบ Port วิศวะคอมฯ มาแล้ว 3 ปี ทั้งสถาบันเทคโนโลยีพระจอมเกล้าบางมด ลาดกระบัง พระนครเหนือ จุฬาลงกรณ์ เกษตร ธรรมศาสตร์ มหิดล สงขลานครินทร์ เชียงใหม่ ขอนแก่น และมหาวิทยาลัยระดับท๊อปของสหรัฐอเมริกาและแคนาดา",
    //   video: "https://hamsterhub.co/asset/image/course/gallery/Beam.mp4",
    // },
    // {
    //   header: "น้องจะได้เข้าร่วมแข่งและนำเสนอผลงานไหม?",
    //   content: "",
    //   list: [
    //     "🌐  Global Game Jam มีทั้งแบบไปกิน นอน ออนไซต์ ได้สัมผัสความสามารถของเพื่อนๆ พี่ๆ มหาวิทยาลัย รายการที่เชื่อมต่อนักพัฒนาเกมทั้งโลก ด้วยหัวข้อที่ไม่ยาก ทีมมัธยมจาก Hamster Hub ก็เคยคว้ารางวัลแล้ว",
    //     "🇹🇭  National Software Contest รายการแข่งสร้าง Software ใหญ่สุดของปี มีทั้งรางวัลและโควต้าเข้ามหาวิทยาลัย เป็นเป้าหมายสำคัญของโครงการนี้ ที่จะยกระดับฝีมือให้ถึงขีดสุดของประเทศ คว้าแชมป์ NSC-2025 ให้ได้ รวมถึงทีมที่ไม่ได้รางวัลก็จะได้ทั้งผลงานและประสบการณ์ที่หาได้ยากในระดับมัธยม",
    //     "📊  Young Scientist Competition เป็นรายการด้านโครงงานวิทยาศาสตร์ ที่มีการแข่งขันด้านคอมพิวเตอร์ด้วย ปีหน้าเราวางแผนส่งน้องที่สนใจผลงานด้านการวิเคราะห์ข้อมูล Training AI และงานวิจัยเพื่อนำไปสู่การใช้งานจริง เป็น Portfolio ที่ดีในการเข้ามหาวิทยาลัยชั้นนำเช่นกันครับ",
    //     "🧢  I-New Gen Award เฉพาะน้องที่สนใจในหัวข้อพิเศษ งานนี้เงินรางวัลก็ดี แถมเป็นรายการที่มีชื่อเสียง ถ้าได้เข้ารอบชิง หรือได้รางวัลก็จะเป็น Portfolio ที่มีน้ำหนัก",
    //     "💰  Thailand ICT Awards เป็นการแข่งขันทางธุรกิจเทคโนโลยี ที่เปิดโอกาสให้ทั้งนักเรียนระดับม.ต้น ม.ปลาย และนักศึกษา รวมทั้งนักธุรกิจในสาขาต่างๆ ได้ทั้งประสบการณ์ รางวัล และโอกาสไปแข่งขันต่อที่ต่างประเทศในรายการ Asia Pacific ICT Awards",
    //     "🏆  Hamster Hub: Game Jam เป็นรายการที่จัดกันเทอมละครั้ง ให้น้องๆ ได้ฝึกสร้างผลงานกันแบบต่อเนื่อง ด้วยวัยซนๆ ใกล้ๆ กันเวลาทำงานกัน แลกเปลี่ยน asset และเทคนิคสร้างเกมล้ำๆ ที่แต่ละทีมไปขุดกันมาก็ดูน่ารักมากครับ ผลงาน Game Jam ปีนี้ผ่านมาแล้วทั้ง 2 รอบ สนุกและผลงานดีขึ้นจากปีก่อนๆ ที่ส่งพี่ๆ เข้ามหาวิทลัยระดับท๊อปๆ กันไปเยอะแล้ว",
    //   ],
    //   video: null,
    // },
  ];

  return (
    <div className="course-content">
      <div className="content-text">
        <h2>โครงการ National Project 2025 </h2>
        <p>
          Lorem ipsum dolor, sit amet consectetur adipisicing elit. Magni neque,
          consequuntur rerum rem aut reprehenderit
        </p>
      </div>
      {CourseData.map((item, index) => (
        <div className="course-item" key={index}>
          <h3>{item.header}</h3>
          <p>{item.content}</p>
          {item.list && (
            <ul>
              {item.list.map((listItem, i) => (
                <li key={i}>
                  <p>{listItem}</p>
                </li>
              ))}
            </ul>
          )}
          {item.video && <video src={item.video} controls></video>}
        </div>
      ))}
      <Image
        src="/assets/hamsterimg1.png"
        alt="NationalProject"
        width={600}
        height={600}
        
      />
    </div>
  );
}

export default CourseContent;
